[
  {
    "id": 4,
    "days_to_spend": 10,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrival in Paris - Explore the Eiffel Tower, Trocadéro Gardens, and a Seine River Cruise.",
        "transportation": "Use Paris Métro and buses. Walking is ideal for exploring central Paris."
      },
      {
        "day": 2,
        "plan": "Louvre Museum - Spend the morning exploring the world-renowned Louvre. In the afternoon, visit the Notre-Dame Cathedral and stroll through the Île de la Cité.",
        "transportation": "Métro and buses. Walking between the Louvre and Notre-Dame is scenic and enjoyable."
      },
      {
        "day": 3,
        "plan": "Montmartre & Sacré-Cœur - Explore the artistic district of Montmartre, visit the Sacré-Cœur Basilica, and enjoy a coffee at a local café.",
        "transportation": "Take the Métro to Montmartre, and walk around the neighborhood."
      },
      {
        "day": 4,
        "plan": "Day Trip to Versailles - Visit the Palace of Versailles, its vast gardens, and the Grand Trianon.",
        "transportation": "Take the RER C train from central Paris to Versailles. Walking is required inside the palace grounds."
      },
      {
        "day": 5,
        "plan": "Travel from Paris to Lyon - Visit the Basilica of Notre-Dame de Fourvière and the old town (Vieux Lyon). Enjoy dinner at a traditional bouchon restaurant.",
        "transportation": "Take a high-speed TGV train from Paris to Lyon (2 hours). In Lyon, use trams, buses, and the Métro."
      },
      {
        "day": 6,
        "plan": "Lyon continued - Explore the Presqu’île district, visit the Musée des Beaux-Arts, and walk along the Rhône and Saône rivers.",
        "transportation": "Use the Lyon Métro and buses. Walking around Presqu’île is easy and scenic."
      },
      {
        "day": 7,
        "plan": "Travel from Lyon to Nice - Upon arrival, visit the Promenade des Anglais and relax on the beach.",
        "transportation": "Take a direct TGV train from Lyon to Nice (5 hours). In Nice, use local buses or trams."
      },
      {
        "day": 8,
        "plan": "Nice - Explore the Old Town (Vieux Nice), visit the Cours Saleya Market, and climb Castle Hill (Colline du Château) for panoramic views of the city and sea.",
        "transportation": "Use trams and buses, but walking around Old Nice is the best way to explore."
      },
      {
        "day": 9,
        "plan": "Day Trip to Monaco - Visit Monte Carlo Casino, the Prince's Palace, and the Oceanographic Museum.",
        "transportation": "Take a 30-minute train ride from Nice to Monaco. Walking is easy within Monaco."
      },
      {
        "day": 10,
        "plan": "Departure - Depending on your flight time, relax on the beach or visit the Marc Chagall National Museum in Nice before heading to the airport.",
        "transportation": "Use local buses or trams to get to Nice Côte d'Azur Airport."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Paris",
      "Nice",
      "Lyon"
    ],
    "country_id": 5,
    "created_at": "2024-10-24T21:02:40.343Z",
    "updated_at": "2024-10-24T21:02:40.343Z"
  },
  {
    "id": 12,
    "days_to_spend": 10,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Bangkok. Visit the Grand Palace, Wat Phra Kaew, and Wat Pho, some of Bangkok's most famous sites. Enjoy a traditional Thai lunch at a local restaurant.",
        "transportation": "Metro, taxi or tuk-tuk."
      },
      {
        "day": 2,
        "plan": "Explore Wat Arun and Asiatique the Riverfront for shopping followed by a dinner cruise on the Chao Phraya River. Finish the night at Khao San Road for drinks and street food.",
        "transportation": "River taxi, Walk or tuk-tuk."
      },
      {
        "day": 3,
        "plan": "Visit Chatuchak Weekend Market for shopping. In the afternoon, tour Jim Thompson House and end your day with a relaxing Thai Massage.",
        "transportation": "Metro or taxi."
      },
      {
        "day": 4,
        "plan": "Fly to Phuket. Visit the Patong beach and lounge by the sea. Enjoy dinner at a local seafood restaurant. Explore the nightlife at Bangla Road.",
        "transportation": "Flight and taxi."
      },
      {
        "day": 5,
        "plan": "Take a day tour through the Phi Phi Islands. Snorkel, swim, and sunbathe on the pristine beaches. Experience lunch with a view on the beach.",
        "transportation": "Speedboat or ferry."
      },
      {
        "day": 6,
        "plan": "Explore the Old Phuket Town for its classic architecture. Visit Big Buddha and Wat Chalong. Enjoy dinner with a stunning view at Karon Viewpoint.",
        "transportation": "Rental car or taxi."
      },
      {
        "day": 7,
        "plan": "Fly to Chiang Mai. Tour Wat Chedi Luang and Wat Phra Singh. Experience a traditional Khantoke dinner with a cultural show.",
        "transportation": "Flight and taxi."
      },
      {
        "day": 8,
        "plan": "Visit an elephant camp to observe and interact with the elephants. Learn how to cook your favourite Thai dishes at a traditional cooking school in the evening.",
        "transportation": "Arranged transportation by tour provider."
      },
      {
        "day": 9,
        "plan": "Fly to Krabi. Relax on Ao Nang Beach and take a stroll down Ao Nang Walking Street for food and shopping. Finish your day with a sunset cruise.",
        "transportation": "Flight, taxi or tuk-tuk."
      },
      {
        "day": 10,
        "plan": "Take a four-island tour to Phra Nang Cave Beach, Chicken Island, Tup Island and Poda Island. Enjoy sunbathing, swimming and snorkeling. Head back to Bangkok for your departure flight.",
        "transportation": "Speedboat or longtail boat, flight."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Bangkok",
      "Phuket",
      "Chiang Mai",
      "Krabi"
    ],
    "country_id": 2,
    "created_at": "2024-10-25T04:21:05.829Z",
    "updated_at": "2024-10-25T04:21:05.829Z"
  },
  {
    "id": 18,
    "days_to_spend": 5,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your first day in Tokyo at the stunning Meiji Shrine, followed by a visit to Takeshita Street in Harajuku for an overdose of pop culture. After lunch there, head to Shibuya crossing, followed by an evening in Shinjuku with its exciting nightlife.",
        "transportation": "Travel within Tokyo will be primarily by subway or taxi. An IC card like Suica or Pasmo would be useful for seamless travel across different subway lines."
      },
      {
        "day": 2,
        "plan": "Spend your second day in Tokyo exploring Asakusa, where you can visit Senso-ji Temple and Nakamise shopping street. After lunch, head to Ueno park, followed by a visit to Ameya Yokocho market for shopping.",
        "transportation": "Travel within Tokyo will be primarily by subway or taxi. An IC card like Suica or Pasmo would be useful for seamless travel across different subway lines."
      },
      {
        "day": 3,
        "plan": "Start your third day in Tokyo with a visit to the Tsukiji fish market. Then, head to Ginza for some upscale shopping. In the afternoon, explore the Odaiba area with its futuristic buildings, Palette town, mega Web Toyota City Showcase and the evening view of Rainbow bridge.",
        "transportation": "Travel within Tokyo will be primarily by subway or train or taxi. An IC card like Suica or Pasmo would be useful for seamless travel across different subway lines."
      },
      {
        "day": 4,
        "plan": "Spend your fourth day outside Tokyo, visiting the iconic Mount Fuji. Visit the 5th Station and enjoy panoramic views, the peaceful Lake Kawaguchiko, and end your day at the renowned Chureito pagoda.",
        "transportation": "Take an early morning bus from Tokyo to Mount Fuji. Shuttles or taxis can be used for local sightseeing around Mount Fuji."
      },
      {
        "day": 5,
        "plan": "On your last day, make a visit to the teamLab Borderless Digital Art Museum in the morning. In the afternoon, head to Akihabara, world-famous for its electronic shops and anime culture. End your day and your trip with a panoramic view of Tokyo from the Tokyo Skytree.",
        "transportation": "Travel within Tokyo will be primarily by subway or taxi. An IC card like Suica or Pasmo would be useful for seamless travel across different subway lines."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Tokyo",
      "Mount Fuji"
    ],
    "country_id": 8,
    "created_at": "2024-10-25T13:12:19.868Z",
    "updated_at": "2024-10-25T13:12:19.868Z"
  },
  {
    "id": 19,
    "days_to_spend": 4,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your Italy adventure by exploring the most iconic landmarks of Rome - the Colosseum, Roman Forum, and Palatine Hill. Enjoy a full day tour learning about the gladiator fights, political affairs, and social events that happened in these remarkable places. To recoup your energy, have a lazy lunch at a local trattoria.",
        "transportation": "From your accommodation, take the Rome Metro Line B to the Colosseo station. Walking between Colosseum, Roman Forum and Palatine Hill is a short distance and provides breathtaking views of the city. Taxis or public buses are also available for this journey."
      },
      {
        "day": 2,
        "plan": "On the second day, visit the Vatican City - a city-state within Rome. Visit St. Peter's Square, St. Peter's Basilica, and marvel at Michelangelo's 'The Creation of Adam' in the Sistine Chapel. End the day visiting Castel Sant'Angelo offering panoramic views of Rome.",
        "transportation": "To get to the Vatican City, take the Rome Metro Line A and alight at Ottaviano. Most attractions within Vatican are walkable, with only short distances between sites. You may consider using a taxi to reach Castel Sant'Angelo later."
      },
      {
        "day": 3,
        "plan": "Spend your third day discovering Piazza Navona, Pantheon, and the renowned Trevi Fountain for making a lucky coin toss. Continue with a walk to the Spanish Steps and finish your day by experiencing Rome's vibrant nightlife culture in Trastevere.",
        "transportation": "Most of these attractions are easily approached on foot from the city center. For quicker transport or tired legs, consider using local buses or taxis. To reach Trastevere, use Rome's bus or tram services."
      },
      {
        "day": 4,
        "plan": "Cap off your Rome adventure with a guided tour of Borghese Gallery housing an extensive collection of classical antiquities. Then proceed to Piazza del Popolo and explore Villa Borghese gardens to leisurely soak in the sun. Finish your trip by having dinner in an authentic Roman restaurant.",
        "transportation": "The easiest way to get to the Borghese Gallery is through Rome's tram or bus system. From Piazza del Popolo, Villa Borghese is just a short and scenic walk away."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T13:21:52.132Z",
    "updated_at": "2024-10-25T13:21:52.132Z"
  },
  {
    "id": 25,
    "days_to_spend": 2,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start the day with a visit to the Vatican City to see the Sistine Chapel and St. Peter's Basilica. From there, head to the iconic Colosseum, followed by the Roman Forum and Palatine Hill. In the evening, visit Piazza Navona and make a wish at the Trevi Fountain.",
        "transportation": "Use the metro to reach Vatican City. Then, use a combination of walking and public buses to reach the other attractions. Taxis are also available if preferred."
      },
      {
        "day": 2,
        "plan": "Begin your day at the Pantheon, followed by a stroll through the Campo de' Fiori market for some local produce. Visit the Spanish Steps in the afternoon, then go shopping in the luxury boutiques of Via dei Condotti. In the evening, explore the Trastevere neighborhood and enjoy a traditional Italian dinner in a local restaurant.",
        "transportation": "Most of the day's attractions can be reached by foot as they are in close distance to one another. Public buses and taxis are also available for those who prefer not to walk."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T18:24:22.062Z",
    "updated_at": "2024-10-25T18:24:22.062Z"
  },
  {
    "id": 26,
    "days_to_spend": 3,
    "itinerary": [
      {
        "day": 1,
        "plan": "Begin your trip at the Grand Palace, a historic site where you can see Wat Phra Kaew, the temple of the Emerald Buddha. After lunch, head over to Wat Phra Chetuphon (Wat Pho), the temple of the Reclining Buddha. In the late afternoon, take a boat to Wat Arun, the Temple of Dawn, which offers an amazing sunset view from across the river.",
        "transportation": "You can take a taxi or tuk-tuk from your hotel to the Grand Palace, then a short walk to Wat Pho. Finally, take a cross-river ferry to Wat Arun."
      },
      {
        "day": 2,
        "plan": "Start your day at Chatuchak Weekend Market, the largest market in Thailand. After lunch, visit Jim Thompson's House, to learn about traditional Thai architecture and silk production. In the evening, explore Sukhumvit Road, which offers a variety of restaurants, bars, and clubs.",
        "transportation": "Take the BTS Skytrain which connects directly to Chatuchak Market and Sukhumvit Road. To reach Jim Thompson's House, take a taxi or tuk-tuk."
      },
      {
        "day": 3,
        "plan": "Spend your day experiencing the vibrant street life and food. Start with a morning trip to Chinatown and Pak Khlong Talat Flower Market. Enjoy lunch at a local street food stall. In the afternoon, visit the Siam area and explore the shopping malls, such as MBK and Siam Paragon. Finally, end the day with a dinner cruise on the Chao Phraya River.",
        "transportation": "Use a combination of tuk-tuk, taxi and the BTS Skytrain to travel around, and take a riverboat for the dinner cruise."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Bangkok"
    ],
    "country_id": 2,
    "created_at": "2024-10-25T18:26:06.369Z",
    "updated_at": "2024-10-25T18:26:06.369Z"
  },
  {
    "id": 27,
    "days_to_spend": 3,
    "itinerary": [
      {
        "day": 1,
        "plan": "Begin the day at the Rashtrapati Bhavan, the Presidential Estate. Follow this with a visit to Raj Ghat, a memorial dedicated to Mahatma Gandhi. Post lunch, see Qutub Minar, a UNESCO World Heritage site, before going to Humayun’s Tomb, another World Heritage site. Wrap up the day at India Gate, war memorials located astride the Rajpath.",
        "transportation": "Pre-book a private vehicle or take local transportation -auto rickshaws, cycle rickshaws, e-rickshaws, cabs or metro, according to your convenience."
      },
      {
        "day": 2,
        "plan": "Begin with exploring Swaminarayan Akshardham, a Hindu temple, followed by a visit to Lotus Temple, a Bahá'í House of Worship known for its flowerlike shape. Post lunch, make your way to the beautifully structured Laxminarayan Temple. The evening time could be spent at Leisure Valley Park, an urban park situated in sector 29.",
        "transportation": "Choose from local taxis, cabs, autobuses or the subway for your day's transport. Lease a private vehicle if desired."
      },
      {
        "day": 3,
        "plan": "Spend the first half in Connaught Place, enjoying some shopping and food in this popular commercial hub. Post lunch, visit Jama Masjid - one of the largest mosques in India. Experience a rickshaw ride in the narrow lanes of Chandni Chowk followed by a visit to Red Fort - a historic fort in Delhi. Conclude your day with a light and sound show at the Red Fort.",
        "transportation": "Choose from local taxis, cabs, auto rickshaws or the subway for your day's transport. Lease a private vehicle if desired."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "New Delhi"
    ],
    "country_id": 3,
    "created_at": "2024-10-25T18:29:40.340Z",
    "updated_at": "2024-10-25T18:29:40.340Z"
  },
  {
    "id": 28,
    "days_to_spend": 3,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your journey with the exploration of Old Delhi. Begin the day with Jama Masjid, the India’s largest mosque. Then visit Chandni Chowk, a bustling marketplace in Old Delhi and taste some of the local street food. Post lunch, proceed towards Red Fort, a historic fort in Delhi where every Independence Day, the Prime Minister hoists the Indian 'tricolour flag'. In the evening visit Raj Ghat, the memorial of Mahatma Gandhi.",
        "transportation": "For Old Delhi, consider a cycle rickshaw ride, a very popular mode of transport, allowing you to dive deep into the hustle and bustle of the old city. For longer distances, you can use taxis or autorickshaws."
      },
      {
        "day": 2,
        "plan": "Kick off the second day with a visit to Qutub Minar, the tallest brick minaret in the world. Then head towards the Lotus Temple, a notable architectural marvel. Post lunch, explore Humayun’s Tomb, a UNESCO World Heritage Site. In the evening, make your way to India Gate, a war memorial located at Rajpath which is also a popular picnic spot in the evening.",
        "transportation": "You can hire a taxi for a day or use the Delhi Metro for a more local experience. The sites are quite spread out, so public transport like auto-rickshaws and cycle rickshaws are not recommended."
      },
      {
        "day": 3,
        "plan": "Spend your third day visiting the political edifices of New Delhi area. Start with Rashtrapati Bhawan, the presidential residence then proceed towards Parliament House. Afterwards, visit the National Museum which houses several artifacts from ancient India. Post lunch, head to Akshardham Temple, a spectacularly grand temple complex in Delhi. At the end of the day, enjoy a stroll around the beautiful, peaceful Lodhi Gardens.",
        "transportation": "You can hire a taxi for a day or use the Delhi Metro. Taking a chauffeur-driven car for a day is also a convenient option to explore these places."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "New Delhi"
    ],
    "country_id": 3,
    "created_at": "2024-10-25T18:29:54.851Z",
    "updated_at": "2024-10-25T18:29:54.851Z"
  },
  {
    "id": 1,
    "days_to_spend": 7,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrival in Rome - The Eternal City offers iconic landmarks like the Colosseum, Roman Forum, and Trevi Fountain. Start your day with a leisurely exploration of these historic sites.",
        "transportation": "Public transportation options include buses, trams, and the metro. Taxis are available, but walking is ideal for exploring central Rome."
      },
      {
        "day": 2,
        "plan": "Rome continued - Visit the Vatican City, including St. Peter's Basilica and the Sistine Chapel. End your day with a stroll through Piazza Navona and the Pantheon.",
        "transportation": "Use the metro or buses for Vatican City. Walking is the best way to explore the surrounding areas."
      },
      {
        "day": 3,
        "plan": "Travel to Florence - Enjoy a scenic train ride from Rome to Florence. Once in Florence, visit the Duomo, Piazza della Signoria, and Uffizi Gallery.",
        "transportation": "Take a high-speed train (Frecciarossa or Italo) from Rome to Florence in about 1.5 hours. Walking or using local buses for Florence sightseeing."
      },
      {
        "day": 4,
        "plan": "Florence continued - Explore more of Florence, including the Ponte Vecchio, Boboli Gardens, and Michelangelo's David at the Galleria dell'Accademia.",
        "transportation": "Florence is very walkable, but buses are available for longer distances."
      },
      {
        "day": 5,
        "plan": "Travel to Venice - Head to Venice by train and spend the day exploring St. Mark's Square, St. Mark's Basilica, and the Doge's Palace.",
        "transportation": "Take a high-speed train from Florence to Venice (2 hours). In Venice, use water buses (vaporetti) to get around or walk through the winding streets."
      },
      {
        "day": 6,
        "plan": "Venice continued - Enjoy a gondola ride, visit the Rialto Bridge, and explore the islands of Murano (for glass-making) and Burano (for colorful houses).",
        "transportation": "Gondolas and water buses are the main forms of transportation within Venice. Ferries are available to the nearby islands."
      },
      {
        "day": 7,
        "plan": "Departure - Depending on your flight time, relax in a café or visit the Venice Biennale art exhibition before heading to the airport.",
        "transportation": "Take a water taxi or Alilaguna (water bus) to Venice Marco Polo Airport."
      }
    ],
    "good_to_travel": {
      "month": "December",
      "isGoodMonth": true,
      "message": "December can be a great time to visit Italy, especially for those who enjoy festive Christmas markets, fewer tourists, and cooler weather. Rome and Florence are lively with holiday lights and events."
    },
    "cities_included": [
      "Rome",
      "Florence",
      "Venice"
    ],
    "country_id": 1,
    "created_at": "2024-10-24T18:11:32.607Z",
    "updated_at": "2024-10-24T18:11:32.607Z"
  },
  {
    "id": 2,
    "days_to_spend": 7,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrival in Bangkok - December is a great time to visit Bangkok due to cooler, less humid weather. Visit iconic spots like the Grand Palace, Wat Phra Kaew, and Wat Arun.",
        "transportation": "Public transport options include taxis, Tuk-Tuks, and the Skytrain (BTS)."
      },
      {
        "day": 2,
        "plan": "Bangkok continued - Explore the Chatuchak Weekend Market, take a Chao Phraya River cruise, and visit Chinatown for unique experiences.",
        "transportation": "Use the BTS Skytrain to navigate inner-city travel and avoid traffic."
      },
      {
        "day": 3,
        "plan": "Travel to Phuket - Take a 1.5-hour flight from Bangkok or opt for a bus or train ride, which takes around 12-13 hours. Upon arrival, explore Old Town Phuket and visit the Big Buddha.",
        "transportation": "Fly via domestic airlines like AirAsia or Thai Lion Air, or use buses/trains for longer travel."
      },
      {
        "day": 4,
        "plan": "Phuket sightseeing - Enjoy Patong Beach, Freedom Beach, and water activities like snorkeling or kayaking.",
        "transportation": "Rent a motorbike or car, or use Tuk-Tuks for travel around the city."
      },
      {
        "day": 5,
        "plan": "Travel to Krabi - Take a ferry (2 hours) or bus (3-4 hours) from Phuket to Krabi. Relax at Ao Nang Beach after arrival.",
        "transportation": "Ferries are a scenic option; buses offer a cheaper alternative."
      },
      {
        "day": 6,
        "plan": "Krabi exploration - Visit Railay Beach and enjoy island hopping at the Four Islands (Chicken Island, Tup Island, Poda Island, Phra Nang Cave Beach).",
        "transportation": "Long-tail boats are best for island hopping, while motorbikes or Tuk-Tuks work well for city travel."
      },
      {
        "day": 7,
        "plan": "Departure - Depending on your flight time, visit the Emerald Pool or Hot Springs before heading to Krabi International Airport.",
        "transportation": "Krabi Airport offers flights back to Bangkok and other international destinations."
      }
    ],
    "good_to_travel": {
      "month": "December",
      "isGoodMonth": true,
      "message": "December is an excellent time to visit Thailand due to pleasant weather and fewer chances of rain. It's the peak tourist season, so expect more crowds, especially in popular areas like Bangkok and Phuket."
    },
    "cities_included": [
      "Bangkok",
      "Phuket",
      "Krabi"
    ],
    "country_id": 2,
    "created_at": "2024-10-24T18:11:32.607Z",
    "updated_at": "2024-10-24T18:11:32.607Z"
  },
  {
    "id": 3,
    "days_to_spend": 6,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your journey in the historic city of Rome with a tour of the iconic Colosseum. In the afternoon, visit the Roman Forum and Palatine Hill for a sense of the Ancient Roman civilisation.  Finish off your day by throwing a coin into the Trevi Fountain, the largest Baroque fountain in Rome promising a return to Rome.",
        "transportation": "Subway to Colosseum, walk to Roman Forum, Palatine Hill and Trevi Fountain."
      },
      {
        "day": 2,
        "plan": "Devote the day to Vatican City. Start at the Vatican Museums, home to an immense collection of art and history. Don’t miss the Sistine Chapel, with its famous frescoed ceiling by Michelangelo. In the afternoon, explore St. Peter’s Basilica, the largest church in the world.",
        "transportation": "Subway to Ottaviano, then walk to the Vatican City."
      },
      {
        "day": 3,
        "plan": "Visit the beautiful Spanish Steps and nearby Trinità dei Monti. Continue to Piazza Navona, a public space established in the 1st Century AD, now bustling with street artists, cafes and restaurants. Visit the Pantheon, a remarkably well-preserved temple dedicated to Rome’s gods. Finish your day in Rome with a walk along Via del Corso for shopping.",
        "transportation": "Walk or bus around the city center."
      },
      {
        "day": 4,
        "plan": "Travel to the mesmerizing city of Venice. Spend your first evening enjoying a romantic gondola ride in its famed canals, and discover the city's unparalled charm.",
        "transportation": "Take a high-speed train from Rome to Venice, then use vaporetto (water bus) and walking. Gondola ride in the evening."
      },
      {
        "day": 5,
        "plan": "Tour the heart of Venice at the Piazza San Marco. Visit San Marco Basilica and Doge's Palace, then ascend the Campanile for panoramic views of the city. In the afternoon, take a Vaporetto to the Rialto Bridge and enjoy the Grand Canal view.",
        "transportation": "Walk and vaporetto to major attractions."
      },
      {
        "day": 6,
        "plan": "Escape the city to the islands of Murano and Burano. In Murano be mesmerized by the art of glass blowing and take time to explore Burano known for its lace-making and brightly-colored houses. After returning to Venice, wrap up your trip with an aperitivo and meal at a local bacaro (wine bar).",
        "transportation": "Vaporetto to Murano and Burano. Walk or vaporetto back to Venice city center."
      }
    ],
    "good_to_travel": {
      "month": "December",
      "isGoodMonth": true,
      "message": "December can be a great time to visit Italy, especially for those who enjoy festive Christmas markets, fewer tourists, and cooler weather. Rome and Florence are lively with holiday lights and events."
    },
    "cities_included": [
      "Rome",
      "Venice"
    ],
    "country_id": 1,
    "created_at": "2024-10-24T18:11:32.607Z",
    "updated_at": "2024-10-24T18:11:32.607Z"
  },
  {
    "id": 11,
    "days_to_spend": 8,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Marseille. Visit the Old Port of Marseille and chill at some local cafes. Explore Le Panier, the oldest quarter in the city.",
        "transportation": "From Marseille-Provence Airport, take a taxi to the city center. Most attractions in the city are navigable on foot or by public transport."
      },
      {
        "day": 2,
        "plan": "Explore Basilique Notre-Dame de la Garde, the symbol of Marseille. After lunch, visit Chateau d'If, the famous castle-turned-prison.",
        "transportation": "Public transportation is available to these attractions, but consider taking a taxi or a mini-train ride to Notre-Dame de la Garde."
      },
      {
        "day": 3,
        "plan": "Take a day trip to the Calanques National Park and enjoy a boat tour. Return to Marseille for the evening.",
        "transportation": "Public transit is available to reach the Park. Boat tours are organized from the port of Marseille."
      },
      {
        "day": 4,
        "plan": "Travel to Paris by train. Visit the Eiffel Tower and relax on the lawn of the Champ de Mars. Visit the Louvre Museum in the evening.",
        "transportation": "Take a TGV train from Marseille to Paris, then use the Paris Metro or a taxi to reach your destinations."
      },
      {
        "day": 5,
        "plan": "Morning visit to the Notre-Dame Cathedral. After lunch, visit the Pompidou Centre. Walk the artistic neighborhood of Montmartre in the evening, ending at the Sacre-Coeur.",
        "transportation": "Use the Paris Metro to easily reach these locations."
      },
      {
        "day": 6,
        "plan": "Start the day at the Palace of Versailles. Spend the evening at the famous Moulin Rouge cabaret.",
        "transportation": "Take a train to Versailles, then the Metro to the Moulin Rouge."
      },
      {
        "day": 7,
        "plan": "Travel to Nice by train. Visit the colorful Cours Saleya Market and spend the afternoon on the Nice beaches. Enjoy French dinner.",
        "transportation": "Take a TGV train from Paris to Nice, then use local public transport to reach your destinations."
      },
      {
        "day": 8,
        "plan": "Visit the Nice's Old Town and climb the Castle Hill for great views of the city. Finish your trip with a delicious seafood dinner.",
        "transportation": "Most destinations are navigable on foot. For longer distances, use local public transport or a taxi."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Marseille",
      "Paris",
      "Nice"
    ],
    "country_id": 5,
    "created_at": "2024-10-25T04:15:08.922Z",
    "updated_at": "2024-10-25T04:15:08.922Z"
  },
  {
    "id": 5,
    "days_to_spend": 8,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Tokyo and get settled into accommodations. Visit Tokyo exchange itineraries and start with the world-renowned Tokyo Skytree for a panoramic view of the city. In the evening, take a stroll around the Ameyoko market and taste some delicious street food.",
        "transportation": "From the airport, take the Narita Express train to reach Tokyo station. Get a Suica card for traveling in metros and buses. From Tokyo Skytree, train to Ameyoko is the best way."
      },
      {
        "day": 2,
        "plan": "Explore Imperial Palace, the residence of the Emperor of Japan and the gardens around it. Afterwards, head to Asakusa to visit Senso-ji, the oldest Buddhist temple in Tokyo. Spend the evening at Odaiba, a man-made island with numerous attractions.",
        "transportation": "Because these destinations are in Tokyo, public metro and bus would be ideal to get around."
      },
      {
        "day": 3,
        "plan": "Spend the day at Shinjuku. Visit Shinjuku Gyoen, one of the largest parks in Tokyo and then head to the Tokyo Metropolitan Government Building's observation deck. In the evening, explore the vibrant nightlife at Kabukicho district.",
        "transportation": "Metro and bus services are efficient within Shinjuku ward."
      },
      {
        "day": 4,
        "plan": "Travel to Mount Fuji. Visit Fuji Five Lakes and enjoy the beautiful views of the Mount Fuji. Try to visit the Chureito Pagoda which is particularly famous for its scenic view of Mount Fuji in the backdrop. Note: December could be chilly, dress warmly.",
        "transportation": "Take a bus or train from Tokyo to Mount Fuji. For travelling around the area, local buses or hired bicycles are a good option."
      },
      {
        "day": 5,
        "plan": "Head to Hakone, famous for hot springs, outdoor activities, and its views of Mount Fuji. Take a ropeway ride and explore The Hakone Shrine located by the Ashi Lake. Return to Tokyo for the night.",
        "transportation": "Buses are available from Mount Fuji to Hakone. The Hakone Free Pass might be a good investment for unlimited use of transportation around Hakone."
      },
      {
        "day": 6,
        "plan": "Travel to Kyoto early in the morning. Visit Fushimi Inari Shrine, famous for its thousands of vermilion torii gates. Spend the evening exploring Gion, the traditional entertainment district where you can spot Geisha.",
        "transportation": "Take the Shinkansen (Bullet Train) from Tokyo to Kyoto. For local transport, buses and taxis are efficient."
      },
      {
        "day": 7,
        "plan": "Spend the day exploring Arashiyama Bamboo Grove and Kinkaku-ji (The Golden Pavilion). In the evening, visit the Nijo Castle.",
        "transportation": "Kyoto's efficient bus and metro system will help you travel between sights."
      },
      {
        "day": 8,
        "plan": "Visit Kiyomizu-dera, a historic temple that offers stunning views of Kyoto against a backdrop of cherry blossoms or autumn colors. Later, prepare for the journey back home.",
        "transportation": "Local buses or taxis are recommended for commutation within Kyoto. Travel back to Tokyo by Shinkansen."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Tokyo",
      "Mount Fuji",
      "Kyoto"
    ],
    "country_id": 8,
    "created_at": "2024-10-24T21:14:31.427Z",
    "updated_at": "2024-10-24T21:14:31.427Z"
  },
  {
    "id": 7,
    "days_to_spend": 6,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Tokyo. Spend your first day exploring the famous Shinjuku district. This includes shopping and dining at Shinjuku Gyoen, Tokyo Metropolitan Government Building, Golden Gai and Omoide Yokocho.",
        "transportation": "From Narita or Haneda Airport, take the train to Shinjuku Station."
      },
      {
        "day": 2,
        "plan": "Visit Asakusa to see Senso-ji Temple, then go to Ueno for Ueno Park and Ameya Yokocho Market. In the afternoon, explore Akihabara, the famous electronics and anime district.",
        "transportation": "From Shinjuku Station, take the JR Yamanote line to Ueno Station, then switch to the Ginza subway line to Asakusa. For Akihabara, take the JR Yamanote line."
      },
      {
        "day": 3,
        "plan": "Explore Odaiba, visiting the teamLab Borderless, Palette Town Ferris Wheel, and Odaiba Seaside Park. In the evening, visit Roppongi district for its nightlife and Tokyo City View Observation Deck.",
        "transportation": "Take the Rinkai line from Shinjuku Station to Tokyo Teleport Station. For Roppongi, take the Oedo subway line."
      },
      {
        "day": 4,
        "plan": "Travel to Shibuya to experience the famous Shibuya Crossing, Hachiko statue, and shopping. Then, visit Harajuku for the Takeshita Street and Meiji Shrine.",
        "transportation": "Take the JR Yamanote line from Shinjuku Station to Shibuya Station and Harajuku station."
      },
      {
        "day": 5,
        "plan": "Take a day trip to Mount Fuji. Explore the Fuji Five Lakes, enjoy a boat ride on Lake Kawaguchiko, and, if possible, climb up to Station 5 of Mount Fuji.",
        "transportation": "Take a tour bus or the Fujikyu Railway from Shinjuku Station to Mount Fuji."
      },
      {
        "day": 6,
        "plan": "Visit Tsukiji Fish Market in the morning, then explore the upscale shopping district, Ginza. In the afternoon, journey to Oshiage to visit Tokyo Skytree and finish the tour with a panoramic view of Tokyo.",
        "transportation": "Take the Hibiya subway line from Shibuya to Tsukiji Station. For Ginza, continue on the Hibiya line. For Tokyo Skytree, switch to the Asakusa subway line at Higashi-ginza Station, then get off at Oshiage Station."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Tokyo",
      "Mount Fuji"
    ],
    "country_id": 8,
    "created_at": "2024-10-25T00:37:08.830Z",
    "updated_at": "2024-10-25T00:37:08.830Z"
  },
  {
    "id": 8,
    "days_to_spend": 10,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Rome. Visit the Colosseum, Roman Forum, and Palatine Hill, for an introductory immersion into the city's ancient history. Wander around and dine in Trastevere neighborhood.",
        "transportation": "Flight to Rome. In the city, walk or use public transportation (bus, metro or tram rails), or rent a scooter."
      },
      {
        "day": 2,
        "plan": "Continue exploring Rome. Visit the Vatican Museum, the Sistine Chapel and the magnificent St. Peter's Basilica. Spend the evening at a wine bar in the trendy Monti neighborhood.",
        "transportation": "Walk or use Rome's public transportation."
      },
      {
        "day": 3,
        "plan": "Visit other unmissable sights of Rome, such as the Pantheon, the Spanish Steps, and Trevi Fountain. Try traditional Roman cuisine in a local 'trattoria'.",
        "transportation": "Walk or use Rome's public transportation."
      },
      {
        "day": 4,
        "plan": "Travel from Rome to Venice. Visit Saint Mark’s Square, Doge's Palace, and enjoy a gondola ride.",
        "transportation": "High speed train from Rome to Venice."
      },
      {
        "day": 5,
        "plan": "Explore more of Venice's canals, visit its museums and the vibrant Rialto Market.",
        "transportation": "Walking and taking the 'vaporetto' (water bus) are the best way to explore Venice."
      },
      {
        "day": 6,
        "plan": "From Venice, travel to Cinque Terre. Explore the five towns, relax on the beach, or hike the Cinque Terre National Park trails.",
        "transportation": "Train from Venice to La Spezia, then the regional train to the Cinque Terre villages."
      },
      {
        "day": 7,
        "plan": "Spend another day in Cinque Terre. Enjoy the stunning views, local cuisine and perhaps a boat tour to see the coastline.",
        "transportation": "The train and boats connect the Cinque Terre villages, or you may choose to walk."
      },
      {
        "day": 8,
        "plan": "Travel to Tuscany. Explore Florence, visit the Uffizi Gallery, the Duomo, and Ponte Vecchio. Indulge in a traditional Tuscan meal.",
        "transportation": "Train from La Spezia to Florence."
      },
      {
        "day": 9,
        "plan": "Take a day trip to visit the vineyards of Chianti region or explore the scenic medieval towns in the area like Siena or San Gimignano.",
        "transportation": "Car rental is recommended for the day to get around Tuscany."
      },
      {
        "day": 10,
        "plan": "Spend the last day in Florence. Visit the Accademia Gallery to see Michelangelo's David. Shop for leather goods and souvenirs. Depart from Florence.",
        "transportation": "Walk or use Florence's public transportation. Flight from Florence's airport for your departure."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Venice",
      "Cinque Terre",
      "Tuscany"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T00:59:41.564Z",
    "updated_at": "2024-10-25T00:59:41.564Z"
  },
  {
    "id": 9,
    "days_to_spend": 10,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your journey in New Delhi. Visit the Red Fort, a historic Mughal fortification, take a stroll in the Chandni Chowk Market and visit the famous Indian temple, Akshardham.",
        "transportation": "Travel from your hotel using local taxis or auto-rickshaws, then explore these places by walking."
      },
      {
        "day": 2,
        "plan": "Continue exploring New Delhi by visiting Humayun's Tomb and Qutub Minar. In the afternoon, spend some time at Lodhi Garden.",
        "transportation": "Travel through a mix of local taxis or tuk-tuks and walking."
      },
      {
        "day": 3,
        "plan": "Visit India Gate and Rashtrapati Bhavan in the morning. Then explore the Lotus Temple and National Museum in the afternoon.",
        "transportation": "Hire a local taxi or use the Delhi Metro."
      },
      {
        "day": 4,
        "plan": "Travel to Jaipur, known as 'The Pink City'. Rest and prepare for the next three days of sightseeing in Jaipur.",
        "transportation": "Train or a private cab from New Delhi to Jaipur."
      },
      {
        "day": 5,
        "plan": "Visit Amber Fort, Jaigarh Fort and Jal Mahal (Water Palace). Enjoy the light and sound show at Amber Fort in the evening.",
        "transportation": "Hire a local taxi or auto-rickshaw to get around."
      },
      {
        "day": 6,
        "plan": "Explore the City Palace, Jantar Mantar, and Hawa Mahal. In the evening visit the bustling local market, Johari Bazaar.",
        "transportation": "Reach these places by taxi, auto-rickshaw or even on foot."
      },
      {
        "day": 7,
        "plan": "Travel to Agra. Rest and prepare for the next two days of sightseeing in Agra.",
        "transportation": "Take a train or a private cab from Jaipur to Agra."
      },
      {
        "day": 8,
        "plan": "Visit the world-renowned Taj Mahal early in the morning to catch the sunrise. In the afternoon, explore Agra Fort and Mehtab Bagh.",
        "transportation": "Local transport like auto-rickshaw, cycle-rickshaw and taxis."
      },
      {
        "day": 9,
        "plan": "Visit the tomb of Itmad-ud-Daulah, also known as the 'Baby Taj'. In the afternoon, explore the local markets for souvenirs and local crafts.",
        "transportation": "Get around Agra by taxi or auto-rickshaw."
      },
      {
        "day": 10,
        "plan": "Return back to New Delhi for departure. Have a leisurely breakfast and leave for Delhi.",
        "transportation": "Take a train or a private cab back to New Delhi."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "New Delhi",
      "Jaipur",
      "Agra"
    ],
    "country_id": 3,
    "created_at": "2024-10-25T04:02:05.260Z",
    "updated_at": "2024-10-25T04:02:05.260Z"
  },
  {
    "id": 10,
    "days_to_spend": 7,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Bordeaux. Start the day by exploring the Old Town, visit Place de la Bourse and the Miroir d'eau. After that, stroll along Rue Sainte-Catherine for shopping and dining.",
        "transportation": "Travel by cab or foot for the day. To get here, consider using a flight or train."
      },
      {
        "day": 2,
        "plan": "Visit the Cité du Vin, a must-visit for wine enthusiasts. In the afternoon, explore the St André Cathedral and Tower Pey Berland. Follow up with a tour of Bordeaux's famous vineyards.",
        "transportation": "Travel by public transportation, bike, or on foot."
      },
      {
        "day": 3,
        "plan": "Spend the day at the Bassin d’Arcachon, climb the Dune du Pilat and experience the fresh sea air and outstanding views. Enjoy fresh oysters from local market on the waterfront.",
        "transportation": "A regional train will take you there in less than an hour."
      },
      {
        "day": 4,
        "plan": "Travel to Paris. Unwind and settle into your lodging. In the evening, visit the Eiffel Tower, potentially witnessing the amazing light show.",
        "transportation": "Catch a morning train or a flight to Paris. The city's public transportation system should cover all moving around needs you have."
      },
      {
        "day": 5,
        "plan": "Start the day by visiting the Musée du Louvre, then walk along the River Seine to the Notre-Dame Cathedral. Finally, visit Sainte-Chapelle to see the stunning stained glass windows.",
        "transportation": "Travel by Metro, which is quick and cost-effective."
      },
      {
        "day": 6,
        "plan": "Explore the historical Montmartre district on foot, visiting the Sacré-Cœur Basilica and the Place du Tertre. Spend the evening enjoying a show at the Moulin Rouge.",
        "transportation": "Use the funicular railway to reach the top of Montmartre, then explore on foot or by cab."
      },
      {
        "day": 7,
        "plan": "Spend the last day visiting the Palace of Versailles. Explore the opulent palace, the vast gardens, and the Hall of Mirrors. Return to Paris and prepare to depart.",
        "transportation": "Take a train to Versailles and return by train in the evening."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Bordeaux",
      "Paris"
    ],
    "country_id": 5,
    "created_at": "2024-10-25T04:04:14.749Z",
    "updated_at": "2024-10-25T04:04:14.749Z"
  },
  {
    "id": 13,
    "days_to_spend": 8,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start your trip with the iconic city of Rome. Visit the Colosseum and the Roman Forum in the morning to take a trip back to the Times of Gladiators. In the afternoon, head over to Palatine Hill for a panoramic view of the city.",
        "transportation": "Upon arrival at Rome Airport (Fiumicino or Ciampino), take a taxi or shuttle to your hotel. Navigate the city using public transportation or walking."
      },
      {
        "day": 2,
        "plan": "Dedicate your second day in Rome to Vatican City. Explore St. Peter's Basilica, and Vatican Museums where you can witness the Sistine Chapel.",
        "transportation": "Travel by metro or bus to the Vatican City. To avoid long waiting times, consider buying skip-the-line tickets or booking a guided tour."
      },
      {
        "day": 3,
        "plan": "On your last day in Rome, stroll around Piazza Navona, visit the Pantheon, and toss a coin in the Trevi Fountain. Don't forget to explore the Spanish Steps and Trastevere neighborhood in the evening.",
        "transportation": "Use the local bus system or walk. Most of these locations are accessible by foot and close to each other."
      },
      {
        "day": 4,
        "plan": "Leave Rome and head to Florence. Upon arrival, take your time to relax and adjust. In the late afternoon, stroll around the city and basilica of Santa Maria del Fiore, and enjoy a sunset view at Piazzale Michelangelo.",
        "transportation": "Take a high-speed morning train from Rome to Florence, which takes about 1.5 hours."
      },
      {
        "day": 5,
        "plan": "Spend your first full day in Florence visiting The Uffizi Gallery, home to thousands of Renaissance paintings. In the afternoon, explore The Accademia Gallery, where Michelangelo's 'David' is housed.",
        "transportation": "Florence is a compact city and is best explored on foot."
      },
      {
        "day": 6,
        "plan": "On your second day in Florence, visit the iconic Ponte Vecchio bridge, explore Palazzo Vecchio and visit Boboli Gardens for an immersive nature walk.",
        "transportation": "Florence is a very walkable city. In case you prefer not to walk, public buses and trams are available."
      },
      {
        "day": 7,
        "plan": "On your last full day in Florence, take a day trip to the picturesque Tuscan countryside. Visit a vineyard and enjoy a wine tasting experience.",
        "transportation": "Day trips can be arranged through various tour agencies that provide round-trip transportation."
      },
      {
        "day": 8,
        "plan": "On your final day, do some last-minute shopping at the Mercato Centrale or souvenir shops, then prepare for your departure.",
        "transportation": "Use public transportation or a taxi to get to the Florence airport or train station for your departure."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Florence"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T05:20:05.482Z",
    "updated_at": "2024-10-25T05:20:05.482Z"
  },
  {
    "id": 14,
    "days_to_spend": 5,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrival in Rome. Visit the Colosseum and The Roman Forum in the morning. In the afternoon proceed to the Pantheon and Piazza Navona. In the evening, relax in the Trastevere district, known for its restaurants and nightlife.",
        "transportation": "Airport transfer by pre-arranged car. Use the Metro and walking for sightseeing, or rent a bicycle for more flexibility."
      },
      {
        "day": 2,
        "plan": "Spend the day in Vatican City. Visit the Vatican Museum to see the Sistine Chapel and St. Peter's Basilica. In the afternoon, explore Villa Borghese Garden, it's a great place to escape the bustling city.",
        "transportation": "Use public transport buses or Metro to reach Vatican City. Use taxi or walk to visit the Villa Borghese Garden."
      },
      {
        "day": 3,
        "plan": "Travel to Tuscany. Explore the historic city of Florence, including the Florence Cathedral, Uffizi Gallery and Ponte Vecchio. Spend the evening enjoying Tuscan cuisine at a local restaurant.",
        "transportation": "Take a train from Rome to Florence. Walking is ideal for city sightseeing, or use public transportation for longer distances."
      },
      {
        "day": 4,
        "plan": "Continue exploring Tuscany by visiting the city of Pisa and its famous Leaning Tower. In the afternoon proceed to the town of Lucca, where you can walk along the ancient walls and explore the charming old town.",
        "transportation": "Take a train from Florence to Pisa, then another train to Lucca. All the attractions are within walking distance from the train stations."
      },
      {
        "day": 5,
        "plan": "Spend the day in the heart of Chianti region sampling wines and visiting vineyards. Go back to Rome in the evening for catching flight home next day.",
        "transportation": "Private guided tour bus will take you through the vineyards. Take a train or pre-arranged car to go back to Rome."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Tuscany"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T05:23:10.317Z",
    "updated_at": "2024-10-25T05:23:10.317Z"
  },
  {
    "id": 15,
    "days_to_spend": 5,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Phuket. Check in at your hotel and freshen up. Visit Patong Beach, the most famous beach in Phuket known for its nightlife and sporting activities. Have a dinner at one of the beachfront restaurants.",
        "transportation": "From Phuket airport, take a taxi or a shuttle bus to your hotel. Use local tuk-tuks or taxi for movement within the city."
      },
      {
        "day": 2,
        "plan": "Visit the Big Buddha, one of Phuket's most important and revered landmarks. Afterwards, explore the Wat Chalong temple. Later, enjoy panoramic views from the Karon viewpoint. End the day with shopping at the Old Phuket Town.",
        "transportation": "Use local tuk-tuks, taxis or rent a motorbike to explore Phuket."
      },
      {
        "day": 3,
        "plan": "Depart for Krabi. Upon arrival, visit Railay Beaches and Caves, one of the most beautiful peninsula in Thailand. Explore the beautiful Phra Nang Cave. Finish the day with a long-tail boat ride and witness a beautiful sunset.",
        "transportation": "Take a ferry from Phuket to Krabi. Use long-tail boats or rent a long-tail for a unique experience."
      },
      {
        "day": 4,
        "plan": "Embark on a tour of the Four Islands which includes Phra Nang Cave Beach, Tup Island, Chicken Island, and Poda Island. Snorkeling, hiking, sunbathing, and exploring can be done. At night, enjoy Krabi's nightlife, especially at Ao Nang Center Point.",
        "transportation": "Tour operators provide pick and drop service from hotels. For nightlife, use local taxis or tuk-tuks."
      },
      {
        "day": 5,
        "plan": "Visit the Emerald Pool and the Hot Springs, two popular natural attractions in Krabi. After that, take a trip to Tiger Cave Temple, a Buddhist temple with a rewarding 1,237-step climb to the summit. Return back to Phuket for your onward journey.",
        "transportation": "Utilize a tour operator or local transportation to visit Emerald Pool and Hot Springs. Return to Phuket via ferry."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Phuket",
      "Krabi"
    ],
    "country_id": 2,
    "created_at": "2024-10-25T05:28:42.880Z",
    "updated_at": "2024-10-25T05:28:42.880Z"
  },
  {
    "id": 16,
    "days_to_spend": 9,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Rome. Settle into your accommodation. Spend the afternoon exploring the neighborhood, and enjoy a relaxing Italian dinner at a local trattoria.",
        "transportation": "Taxi or Shuttle from the airport to the hotel."
      },
      {
        "day": 2,
        "plan": "Full day tour of Rome. Visit the Colosseum, Roman Forum, and the Pantheon. Enjoy some local gelato.",
        "transportation": "Public transportation or Foot for local sightseeing."
      },
      {
        "day": 3,
        "plan": "Continue touring Rome, visit Vatican City, including the Vatican Museums, Sistine Chapel, and St. Peter's Basilica.",
        "transportation": "Public transportation or Foot for local sightseeing."
      },
      {
        "day": 4,
        "plan": "Travel from Rome to Florence. Arrival and relax. In the evening, take a stroll around its historic center.",
        "transportation": "High-speed train from Rome to Florence."
      },
      {
        "day": 5,
        "plan": "Visit Florence's renowned attractions including the Duomo, Uffizi Gallery, and Ponte Vecchio. End the day at Piazzale Michelangelo for beautiful city views.",
        "transportation": "Public transportation or Foot for local sightseeing."
      },
      {
        "day": 6,
        "plan": "Visit the Academia Gallery to see Michelangelo's David. Afternoon trip to the medieval town of Siena.",
        "transportation": "Public transportation for local sightseeing and Scheduled tour bus or rental car for trip to Siena."
      },
      {
        "day": 7,
        "plan": "Travel from Florence to Venice. Arrival and gondola ride on Grand Canal. Explore St. Mark's Square in the evening.",
        "transportation": "High-speed train from Florence to Venice. Foot or water taxi for local sightseeing."
      },
      {
        "day": 8,
        "plan": "Tour Venice's attractions including Doge's Palace, St. Mark's Basilica. Visit the island of Murano famous for its glass-making.",
        "transportation": "Foot or water taxi for local sightseeing. Organized boat tour to the island of Murano."
      },
      {
        "day": 9,
        "plan": "Savor your last day in Italy with a casual exploration of Venice. Shop for souvenirs and enjoy a final Italian pasta or pizza before your departure.",
        "transportation": "Water taxi from hotel to the airport."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Venice",
      "Florence"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T05:40:11.448Z",
    "updated_at": "2024-10-25T05:40:11.448Z"
  },
  {
    "id": 17,
    "days_to_spend": 9,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Rome. Start your day with a visit to the iconic Colosseum, Roman Forum and the Palatine Hill. Spend the evening at The Spanish Steps and throw a coin in the Trevi Fountain.",
        "transportation": "Taxi from airport to hotel. Exploration by foot and public transportation."
      },
      {
        "day": 2,
        "plan": "Visit the Vatican City, taking in the breathtaking beauty of St. Peter's Basilica, Vatican Museums, and the Sistine Chapel. Spend the evening exploring Trastevere district.",
        "transportation": "Public transportation to Vatican City. Exploration by foot."
      },
      {
        "day": 3,
        "plan": "Explore the Pantheon, Piazza Navona, and Campo De' Fiori. Visit Galleria Borghese and wander through the gardens.",
        "transportation": "Exploration by foot and public transportation."
      },
      {
        "day": 4,
        "plan": "Travel to Florence. Visit the Uffizi Gallery and walk towards the Duomo, soaking up the medieval charm of the city. Overnight in Florence.",
        "transportation": "High-speed train from Rome to Florence. Exploration by foot."
      },
      {
        "day": 5,
        "plan": "Spend your day exploring the Accademia Gallery, home to Michelangelo's 'David'. Visit the historic Ponte Vecchio and end your day in Piazzale Michelangelo for a spectacular view of Florence.",
        "transportation": "Exploration by foot."
      },
      {
        "day": 6,
        "plan": "Full day trip to the Tuscan countryside. Visit the medieval towns of Siena and San Gimignano, and stop for a traditional Tuscan lunch and wine tasting in a vineyard.",
        "transportation": "Day trip by bus."
      },
      {
        "day": 7,
        "plan": "Travel to Venice. Take a romantic gondola ride through Venice canals. Explore Piazza San Marco, visit the Doge’s Palace and the Basilica of San Marco. Overnight in Venice.",
        "transportation": "High-speed train from Florence to Venice. Exploration by foot and water bus."
      },
      {
        "day": 8,
        "plan": "Visit the colorful islands of Burano and Murano with a guided boat tour. Spend the afternoon in Rialto Market.",
        "transportation": "Boat ride to the islands. Exploration by foot."
      },
      {
        "day": 9,
        "plan": "Free day for explorations. Wander through the city's maze of canals and alleyways. In the evening, prepare for your flight back the next day.",
        "transportation": "Exploration by foot."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Venice",
      "Florence"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T05:40:34.463Z",
    "updated_at": "2024-10-25T05:40:34.463Z"
  },
  {
    "id": 20,
    "days_to_spend": 3,
    "itinerary": [
      {
        "day": 1,
        "plan": "Start with a visit to the iconic Colosseum. After delving into Roman history, head towards the Roman Forum to see the grandeur of Roman Empire. Later, visit landmark sites on Palatine Hill including the Farnese Gardens. In the evening, visit Piazza Navona, a famous square for its beautiful fountains.",
        "transportation": "The Colosseum is accessible by metro, buses and trams. Roman Forum and Palatine Hill are within walking distance from the Colosseum. Public transportation, taxis or bicycles can be used to reach Piazza Navona."
      },
      {
        "day": 2,
        "plan": "Start the day by visiting Vatican City. Explore the St. Peter's Basilica, Vatican Museums and the Sistine Chapel. In the afternoon, stroll through the Castel Sant'Angelo. In the evening, make your way to the Trastevere neighbourhood for dinner at a traditional Italian restaurant.",
        "transportation": "Vatican City can be reached via metro or bus. From there, all attractions are within walking distance. To reach Trastevere from Castel Sant'Angelo, you can either walk or take a bus."
      },
      {
        "day": 3,
        "plan": "Begin the final day with a visit to the Pantheon, a remarkable Roman landmark. Afterwards, take a stroll to the Trevi Fountain, make a wish and toss a coin into the water. Later in the day, climb the Spanish Steps and take in the view. Finish the day with a relaxing walk around the Villa Borghese gardens.",
        "transportation": "The Pantheon and Trevi fountain are within walking distance from each other. Walking or taking bus is suggested for reaching Spanish steps. Lastly, either walk or take a bus to Villa Borghese gardens."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T15:04:06.103Z",
    "updated_at": "2024-10-25T15:04:06.103Z"
  },
  {
    "id": 21,
    "days_to_spend": 11,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Rome. Check into your hotel and relax or explore nearby areas. You can visit Piazza Navona or Trevi Fountain at night.",
        "transportation": "Flight to Rome. Local transportation: taxi or public transport"
      },
      {
        "day": 2,
        "plan": "Spend a full day in Vatican City, exploring St. Peter's Basilica, Vatican Museums, and the Sistine Chapel.",
        "transportation": "Public transport or taxi"
      },
      {
        "day": 3,
        "plan": "Visit the Colosseum, Roman Forum, and the Palatine Hill. In the afternoon, go see the Pantheon and the Spanish Steps.",
        "transportation": "Walking or public transport"
      },
      {
        "day": 4,
        "plan": "Enjoy a free day in Rome. You might want to go to Campo de' Fiori or the Trastevere district. Alternatively, you could visit the Catacombs or explore the ruins along the Appian Way.",
        "transportation": "Walking or public transport"
      },
      {
        "day": 5,
        "plan": "Travel to Florence. Visit the Florence Cathedral and enjoy a panoramic view of the city from Piazzale Michelangelo in the evening.",
        "transportation": "Train to Florence. Local transportation: walking or public transport"
      },
      {
        "day": 6,
        "plan": "Visit the Uffizi Gallery and Accademia Gallery, home to Michelangelo's 'David'. Later, you could check out the Boboli Gardens or go to the Piazza della Signoria.",
        "transportation": "Walking or public transport"
      },
      {
        "day": 7,
        "plan": "Enjoy a full-day trip to the Tuscany region. Travel through the Chianti countryside, visit medieval towns like San Gimignano and Siena or go wine tasting.",
        "transportation": "Rent a car or join a bus tour"
      },
      {
        "day": 8,
        "plan": "Travel to Venice. Spend the evening experiencing a gondola ride or walking around major landmarks such as St. Mark's Square and the Rialto Bridge.",
        "transportation": "Train to Venice. Local transportation: walking and Vaporetto (water bus)"
      },
      {
        "day": 9,
        "plan": "Explore the islands of Murano, Burano, and Torcello. In Murano, you can see how the famous glass is made, while in Burano, you can see the brightly colored fishermen's houses. ",
        "transportation": "Vaporetto (water bus)"
      },
      {
        "day": 10,
        "plan": "Visit landmarks you've missed such as the Doge's Palace, St. Mark's Basilica, or the Grand Canal. In the afternoon, explore the hidden alleys or discover local eateries.",
        "transportation": "Walking or Vaporetto (water bus)"
      },
      {
        "day": 11,
        "plan": "Depending on your flight time, you might have free time in the morning. Then, head to the Marco Polo Airport for departure.",
        "transportation": "Taxi or public transport to Marco Polo Airport"
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Florence",
      "Venice"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T16:26:59.281Z",
    "updated_at": "2024-10-25T16:26:59.281Z"
  },
  {
    "id": 22,
    "days_to_spend": 15,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrival in Rome and check into your hotel. Get acclimated with the city and explore the local area.",
        "transportation": "Arrive at Rome International Airport. Taxi or shuttle to the hotel."
      },
      {
        "day": 2,
        "plan": "Explore the Vatican City, visiting the Vatican Museums, Sistine Chapel, and St. Peter's Basilica.",
        "transportation": "Take a local bus or taxi to the Vatican City."
      },
      {
        "day": 3,
        "plan": "Visit the Colosseum, Roman Forum, and Palatine Hill.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 4,
        "plan": "Visit the Pantheon, Spanish Steps, and enjoy a stroll in the Villa Borghese gardens.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 5,
        "plan": "Catch any sites missed or revisit a favorite. In the evening, take a night walk around the city and enjoy Rome's night life.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 6,
        "plan": "Travel from Rome to Florence. Check into a hotel and get familiar with the local area.",
        "transportation": "High-speed train to Florence."
      },
      {
        "day": 7,
        "plan": "Visit the iconic Florence Cathedral, the Baptistery, and the Bell Tower.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 8,
        "plan": "Explore the Uffizi Gallery and Accademia Gallery, displaying some of the finest artworks of Renaissance.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 9,
        "plan": "Visit the Boboli Gardens, Ponte Vecchio, and Piazzale Michelangelo for a panoramic view of the city.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 10,
        "plan": "Relax and wander in Florence, explore local cuisines or shop for typical Florentine crafts.",
        "transportation": "Public transport or walking."
      },
      {
        "day": 11,
        "plan": "Travel from Florence to Venice. Check into a hotel and get acquainted with the local area.",
        "transportation": "High-speed train to Venice."
      },
      {
        "day": 12,
        "plan": "Explore St. Mark's Square, the Doge's Palace, and the stunning Basilica.",
        "transportation": "Walking or waterbus."
      },
      {
        "day": 13,
        "plan": "Take a gondola ride through the Grand Canal and visit Rialto market.",
        "transportation": "Walking or gondola."
      },
      {
        "day": 14,
        "plan": "Visit the islands of Murano and Burano, renowned for their unique glassblowing and lace making respectively.",
        "transportation": "Waterbus to the islands."
      },
      {
        "day": 15,
        "plan": "Last day of sightseeing in Venice before departure. Explore local market, enjoy the Venetian cuisines or revisit a favorite spot.",
        "transportation": "Walking or waterbus. At night take flight from Venice International airport."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Venice",
      "Florence"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T16:51:23.593Z",
    "updated_at": "2024-10-25T16:51:23.593Z"
  },
  {
    "id": 23,
    "days_to_spend": 12,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Rome. Get settled into your accommodation and spend the day exploring Rome's local streets, food, and culture at your own pace.",
        "transportation": "Travel from airport to your Rome's accommodation using a taxi, airport shuttle service or public transportation."
      },
      {
        "day": 2,
        "plan": "Explore the historical attractions of Rome. Visit the Colosseum, Roman Forum, and Palatine Hill.",
        "transportation": "Use metro, taxis or walk, as all these attractions are close by."
      },
      {
        "day": 3,
        "plan": "Visit the Vatican City. Explore St. Peter's Basilica, the Vatican Museums, and the Sistine Chapel.",
        "transportation": "Either a taxi or the Metro Line A to Ottaviano Station."
      },
      {
        "day": 4,
        "plan": "Uncover the other gems of Rome. Visit the Pantheon, Piazza Navona, and Trevi Fountain.",
        "transportation": "All places are within walkable distance or accessible via public transport."
      },
      {
        "day": 5,
        "plan": "Transfer from Rome to Florence. Spend the rest of the day at leisure, soaking in the city vibes.",
        "transportation": "Take a high-speed train from Rome to Florence."
      },
      {
        "day": 6,
        "plan": "Explore Florence. Visit the Cathedral of Santa Maria del Fiore, Piazza del Duomo, and walk along the Ponte Vecchio.",
        "transportation": "Most attractions in Florence are close by, so walking is the best option."
      },
      {
        "day": 7,
        "plan": "Immerse yourself in art. Visit the Uffizi Gallery, Accademia Gallery (Galleria dell'Accademia) to see Michelangelo's David.",
        "transportation": "The attractions are within walking distance or short taxi rides away."
      },
      {
        "day": 8,
        "plan": "Transfer from Florence to Venice. Relax and get familiar with the unique water-bound city.",
        "transportation": "Take a high-speed train from Florence to Venice."
      },
      {
        "day": 9,
        "plan": "Walk around Venice, visit St. Mark's Square (Piazza San Marco) and Doge's Palace (Palazzo Ducale).",
        "transportation": "Walking or taking a gondola or vaporetto (water bus)."
      },
      {
        "day": 10,
        "plan": "Continue exploring Venice. Visit the Rialto Bridge and enjoy a gondola ride in the Grand Canal.",
        "transportation": "Walking or taking a gondola or vaporetto."
      },
      {
        "day": 11,
        "plan": "Visit Murano and Burano islands, famous for their glass-making and colorful houses respectively.",
        "transportation": "Take a vaporetto to Murano and Burano islands."
      },
      {
        "day": 12,
        "plan": "Depart from Venice. If time permits, have one last walk around the city before heading to the airport.",
        "transportation": "Take a water taxi or the Alilaguna water bus service to the airport. Or travel by road with a taxi or bus shuttle service."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Rome",
      "Florence",
      "Venice"
    ],
    "country_id": 1,
    "created_at": "2024-10-25T17:42:28.724Z",
    "updated_at": "2024-10-25T17:42:28.724Z"
  },
  {
    "id": 24,
    "days_to_spend": 8,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Bangkok and check into your hotel. Take a relaxing boat tour along the Chao Phraya River, visiting the famous floating markets. Then, experience local culinary delights at Yaowarat Road in Bangkok’s Chinatown.",
        "transportation": "Airport pickup from Suvarnabhumi Airport, taxis or ferries for city travel"
      },
      {
        "day": 2,
        "plan": "Spend the entire day exploring Thailand’s capital city, starting with a visit to the iconic Wat Phra Kaew (Temple of the Emerald Buddha), followed by the stunning Grand Palace. In the afternoon, visit Wat Arun (Temple of Dawn), and end your day with some shopping at one of Bangkok's many vibrant night markets, like Asiatique the Riverfront.",
        "transportation": "Public transportation (BTS Skytrain, buses) and taxis"
      },
      {
        "day": 3,
        "plan": "Head off to Siam Ocean World in the Siam Paragon Mall. In the afternoon, visit Jim Thompson’s House. Afterwards, discover MBK Center or Platinum Fashion Mall for more shopping.",
        "transportation": "Public transportation and taxis"
      },
      {
        "day": 4,
        "plan": "Check out from the hotel in Bangkok and catch a flight to Phuket. After arrival, spend the rest of the day exploring the local markets in old Phuket town or relax at Patong Beach.",
        "transportation": "Flight from Bangkok to Phuket and taxis for city travel"
      },
      {
        "day": 5,
        "plan": "Excursion to Phi Phi Islands for snorkeling and swimming activities. Have lunch on the white sandy beach and take lots of beautiful pictures. In the evening, visit Bangla Road for nightlife.",
        "transportation": "Speedboat or ferry for island excursion, taxis for city travel"
      },
      {
        "day": 6,
        "plan": "Visit Phang Nga Bay and James Bond Island by long-tail boat. In the afternoon, explore the Big Buddha and Wat Chalong. Stunning sunset view from Promthep Cape.",
        "transportation": "Long-tail boat for island hopping, taxis for city travel"
      },
      {
        "day": 7,
        "plan": "Travel from Phuket to Pattaya. Rest and relax for the remainder of the day after checking into your hotel. In the evening, you can explore the Walking Street, Pattaya’s famous nightlife spot.",
        "transportation": "Flight from Phuket to Pattaya, taxis for city travel"
      },
      {
        "day": 8,
        "plan": "Visit ‘Sanctuary of Truth’, a beautiful wooden temple in Pattaya. Then, enjoy the afternoon at Coral Island where you can engage in water sports or simply relax. Conclude the day with a wonderful view from the Pattaya View Point.",
        "transportation": "Speedboat for island hopping, taxis or Songthaew for city travel"
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Bangkok",
      "Phuket",
      "Pattaya"
    ],
    "country_id": 2,
    "created_at": "2024-10-25T17:45:38.365Z",
    "updated_at": "2024-10-25T17:45:38.365Z"
  },
  {
    "id": 29,
    "days_to_spend": 9,
    "itinerary": [
      {
        "day": 1,
        "plan": "Arrive in Bangkok. Visit the Grand Palace, Wat Arun and Wat Phra Kaew, some of Bangkok's most famous attractions. Enjoy street food exploring Chinatown.",
        "transportation": "Flights for arrival. Use local transport like Skytrain, Taxi or Tuk-tuk for city travel."
      },
      {
        "day": 2,
        "plan": "Visit the Chatuchak Weekend Market in the day and experience the vibrant nightlife at Khao San Road in the evening.",
        "transportation": "Taxi services or Skytrain for city commute."
      },
      {
        "day": 3,
        "plan": "Take the River and Canal tour. Visit Wat Saket and crawl up the Golden Mountain to witness a beautiful view of the city.",
        "transportation": "River boat for the tour. Use Taxi services for commute in the city."
      },
      {
        "day": 4,
        "plan": "Travel to Ayutthaya, visit Ayutthaya Historical Park which hosts ancient relics and temples. Visit Wat Yai Chai Mongkhon, Wat Mahathat, and Wat Chaiwatthanaram",
        "transportation": "Trains are available from Bangkok to Ayutthaya. Use bikes for travel inside the city."
      },
      {
        "day": 5,
        "plan": "Visit the Ayutthaya Elephant Palace and Royal Palace and Ayutthaya Floating Market",
        "transportation": "Bicycle or Moto-bike for city commute."
      },
      {
        "day": 6,
        "plan": "Arrive in Phuket. Spend the day at Patong Beach and enjoy the nightlife on the Patong street.",
        "transportation": "Flight from Bangkok to Phuket. Local transport for city commute."
      },
      {
        "day": 7,
        "plan": "Day trip to Phi Phi Islands. Enjoy snorkeling, beach time and optional visit to Maya Bay.",
        "transportation": "Speed boats for Phi Phi Island tour. Local transport for rest of the day."
      },
      {
        "day": 8,
        "plan": "Travel to Krabi. Visit Railay Beaches and Caves, and The Emerald Pool.",
        "transportation": "Ferry from Phuket to Krabi. Use local transport or taxi for city travel."
      },
      {
        "day": 9,
        "plan": "Visit the Tiger Cave Temple and embark on a Four Island Tour. Prepare for departure.",
        "transportation": "Local transport or taxi for city travel. Flight from Krabi for departure."
      }
    ],
    "good_to_travel": null,
    "cities_included": [
      "Bangkok",
      "Phuket",
      "Krabi",
      "Ayutthaya"
    ],
    "country_id": 2,
    "created_at": "2024-10-26T19:31:31.961Z",
    "updated_at": "2024-10-26T19:31:31.961Z"
  }
]